[{"day":"Wednesday","items":[{"time":"9:00 AM","title":"Registration Opens"},{"time":"10:00 AM - 5:00 PM","title":"Angular Beginning Workshop<br /> Angular Advanced Workshop","extra":true},{"time":"12:00 PM","title":"Lunch for Angular &amp; Ionic Workshops","extra":true},{"time":"1:00 PM - 4:00 PM","title":"Ionic Workshop","extra":true},{"time":"7:00 PM - 10:00 PM","title":"Building Microsoft Office Apps with AngularJS Hackathon"},{"time":"7:00 PM - 10:00 PM","title":"Lightning Talks"},{"time":"7:00 PM - 10:00 PM","title":"Open Spaces","link":"http://www.google.com/moderator/#15/e=21469c&t=21469c.40&f=21469c.712be7"},{"time":"7:00 PM - 7:45 PM","title":"Introduction to RethinkDB: realtime apps without database polling"},{"time":"7:00 PM - 7:25 PM","title":"Angular-Meteor, Working with the 2 great eco-systems together by Uri Goldshtein"},{"time":"7:30 PM - 7:55 PM","title":"Isomorphic Angular by Jeff Whelpley"},{"time":"8:00 PM - 8:45 PM","title":"Back& - Build Angular apps with your own MySQL or PostgreSQL Database"},{"time":"8:00 PM - 8:25 PM","title":"Animating Angular by Nick Seegmiller"},{"time":"8:30 PM - 8:55 PM","title":"S.O.L.I.D. Development with AngularFire and D3"},{"time":"9:00 PM - 9:45 PM","title":"Building An Angular Hack Stack"}]},{"day":"Thursday","items":[{"time":"7:00 AM","title":"Breakfast"},{"time":"9:00 AM","title":"Welcome","author":"Brad Green &amp; Igor Minar","key":"keynote-day-1","details":{"Session":{"Title":"Keynote Day 1","Description":"Welcome! Let's talk about the state of Angular.\n","Length":40,"Tags":["keynote","past","present","future","highlights","no tombstones"]},"Speaker":{"name":"Brad Green","twitter":"BradlyGreen","email":"bradgreen@google.com","bio":"Brad Green works at Google as an engineering director.  Brad manages the Google Sales Platform suite of projects as well as the Angular framework. Prior to Google, Brad worked on the early mobile web at AvantGo, founded and sold startups, and spent a few hard years toiling as a caterer. Brad's first job out of school was as lackey to Steve Jobs at NeXT Computer writing demo software and designing his slide presentations. Brad lives in Mountain View, CA with his wife and two children.\n"},"Speaker2":{"name":"Igor Minar","twitter":"IgorMinar","email":"iminar@google.com","bio":"Igor is a software engineer at Google. He is a lead on the Angular project, practitioner of test driven development, open source enthusiast, hacker.\nIn his free time, Igor enjoys spending time with his wife and two kids, doing outdoor activities (including but not limited to sports, gardening and building retaining walls).\n"}},"link":"/#details/keynote-day-1"},{"time":"9:50 AM","title":"State of 1.x","author":"Pawel Kozlowski &amp; Lucas Galfaso","key":"state-of-1x","details":{"Session":{"Title":"State of 1.x","Description":"Growth. Community. Future.\n","Length":20,"Tags":["1.x","angularjs","community"]},"Speaker":{"name":"Pawel Kozlowski","twitter":"pkozlowski_os","email":"pkozlowski.opensource@gmail.com","bio":"Open source hacker, AngularJS book author, AngularUI lead developer. Pawel is an software-development addict who believes in free, open source software. He is a core contributor to the AngularJS framework, AngularUI, Karma-runner and several other projects. He is the co-author of the \"Mastering Web Application Development with AngularJS\" book. When not coding, Pawel can be spotted speaking at various software development conferences.\n"},"Speaker2":{"name":"Lucas Galfaso","twitter":"lgalfaso","email":"lmirelmann@google.com","bio":"Lucas is a Software Engineer at Google and Angular contributor.\n"}},"link":"/#details/state-of-1x"},{"time":"10:15 AM","title":"The New Router","author":"Brian Ford","key":"the-new-router","details":{"Session":{"Title":"The New Router","Description":"You may have heard rumors of a new Angular Router. In this talk, I'll show off the new router in Angular 1 with a focus on building large, maintainable, modular applications. I'll also touch on how this router will work in Angular 2, and how it can serve as a stepping stone for migrating your application.\n","Length":20,"Tags":["routing","architecture"]},"Speaker":{"name":"Brian Ford","twitter":"briantford","email":"bford@google.com","bio":"Brian works on the Angular core team at Google where he tries his very best to make computers do the right thing.\n"}},"link":"/#details/the-new-router"},{"time":"10:40 AM","title":"Prototyping with Angular? YES!!","author":"Kelly Knight &amp; Dirk Ginader","key":"prototyping-yes","details":{"Session":{"Title":"Prototyping with Angular? YES!!","Description":"Prototyping has become an essential part of the design process. In our search for the best framework to use for prototyping, Angular came out on top. We’ll tell you why and show you some easy methods we use to make Angular a powerful prototyping tool.\n","Length":20,"Tags":["material design","UI","UX"]},"Speaker":{"name":"Kelly Knight","twitter":null,"email":null,"bio":"Kelly is a User Experience Engineer and 7 year veteran at Google with 15 years in the tech industry. With experience in both back-end and client-side development, she thrives at bridging the gap between design and engineering. Currently, she’s working on a prototyping platform written in Angular to help designers better express their designs through prototypes. \n"},"Speaker2":{"name":"Dirk Ginader","twitter":"ginader","email":"dirk@ginader.com","bio":"Dirk started building websites professionally in the year Internet Explorer 4 was released. The new technical possibilities blew his mind. The mind blowing has been happening every year since. He can’t wait to see what he’s going to learn next year. \nHe’s been prototyping at Google for the last 2 years. Before that he was working for Yahoo! in the U.S., England and Germany\n"}},"link":"/#details/prototyping-yes"},{"time":"11:05 AM","title":"Fast from the Start","author":"Jeff Cross","key":"fast-from-the-start","details":{"Session":{"Title":"Fast from the Start","Description":"Nothing is more frustrating than a slow web app. Yet, too often, performance is not considered until end users begin to complain about frustrating experiences. Jeff will talk about tools and methods that were used to make Angular 2 fast from the start, and how these tools and methods can be applied to other web applications as well.\n","Length":20,"Tags":["angular2","performance","benchpress"]},"Speaker":{"name":"Jeff Cross","twitter":"jeffbcross","email":"crossj@google.com","bio":"Jeff is a member of the Angular core team at Google, focusing on data access and application performance.  Jeff has an extensive background in open source software, marketing, and user experience design.  When not in front of a computer, he spends his time doing whatever his kids tell him to do, which usually involves playing music or making gadgets.\n"}},"link":"/#details/fast-from-the-start"},{"time":"11:30 AM","title":"Creating Container Components with Web Components and Angular","author":"Kara Erickson &amp; Rachael L Moore","key":"multi-transclude-shadow-dom","details":{"Session":{"Title":"Creating Container Components with Web Components and Angular\n","Description":"So you've embraced architecting your Angular application with reusable  components--cheers to you!  But you have UI components that need multiple  entry points for user markup, and regular ng-transclude left you hanging. In this talk, we'll cover how new web component standards, like the  Shadow DOM, handle this.  Next, we'll walk through how to accomplish it  today in Angular 1.3 -- and also give you a brief glimpse into what a  solution will look like in upcoming Angular 2.\n","Length":20,"Tags":["angular1.3","transclusion","shadowDOM","webcomponents","templates","angular2"]},"Speaker":{"name":"Kara Erickson","twitter":"karaforthewin","email":"kerickson@opentable.com","bio":"Kara is a Software Engineer at OpenTable where she builds Angular applications for OpenTable  Restaurants. She has spent the last six months architecting a robust library of business-level  and UI-level components founded on Angular directives.\n"},"Speaker2":{"name":"Rachael L Moore","twitter":"morewry","email":"rmoore@opentable.com","bio":"Rachael is a UI Engineer at OpenTable specializing in the implementation of  enterprise-scale interfaces using HTML, CSS, and JavaScript. She began as a  freelance web designer in the 90's and previously worked at Homes.com. \n"}},"link":"/#details/multi-transclude-shadow-dom"},{"time":"11:50 AM","title":"Lunch"},{"time":"1:20 PM","title":"ngTasty","author":"Leonardo Zizzamia","key":"ng-tasty","details":{"Session":{"Title":"ngTasty - Building high performance measurable directives","Description":"My team at Twitter is tasked with building internal tools using agile methodologies with a focus  on rapid iteration. This results in a need to build reusable components that we can continually  improve upon. With each new project we increase performance of the components used by all of our  applications. With input from Jeff Cross, I will discuss how we focus on performance when designing  reusable components that are measurably fast. You may already know about Batarang, but how can you  use it in conjunction with Benchpress to design, measure, and identify specific areas of improvement  in your application? I will present real-life examples from our ngTasty implementations at Twitter  that demonstrate how you can use these tools together to develop the fastest directive you have ever made.\n","Length":20,"Tags":["performance","benchmarking","Benchpress","Batarang","Twitter","ngTasty","directives","design"]},"Speaker":{"name":"Leonardo Zizzamia","twitter":"zizzamia","email":"leonardo@twitter.com","bio":"Leo is a software engineer at Twitter and has contributed to Angular by benchmarking with Benchpress. He teaches the \"A Taste of Angular\" and \"Angular Essentials\" classes for Twitter University where he helps Twitter engineers to learn and improve skills with Angular. Leo uses Angular on daily basis on internal applications at Twitter. When Leo is not coding Angular, he can usually be found drinking gibraltar at the @TwitterLodge.\n"}},"link":"/#details/ng-tasty"},{"time":"1:45 PM","title":"TypeScript and ES6","author":"Dan Wahlin &amp; Andrew Connell","key":"supercharge-angularjs-apps-with-typeScript-and-es6","details":{"Session":{"Title":"Supercharge Angular Apps with TypeScript and ES6","Description":"ES6 offers many exciting features that will change how you write JavaScript and Angular applications.  But can you take advantage of ES6 features today while still supporting browsers that don’t fully implement ES6?  In this session you’ll learn about key features found in the TypeScript language (a superset of JavaScript)  and see how they can be used to add ES6-style code into your Angular apps. Topics covered include classes,  inheritance, types, generics, and more.\n","Length":20,"Tags":["Angular","typescript","es6"]},"Speaker":{"name":"Dan Wahlin","twitter":"DanWahlin","email":"dwahlin@thewahlingroup.com","bio":"Dan Wahlin founded Wahlin Consulting which provides consulting and training services  on Web technologies such as JavaScript, Angular, HTML5, Node.js, C#, ASP.NET MVC,  Web API, and SharePoint. He’s also a course author on Pluralsight.com and has  published several courses covering a range of technologies including the   Angular JumpStart course on Udemy.com. Dan speaks at conferences and user  groups around the world and has written several books on Web technologies.   Dan blogs at http://weblogs.asp.net/dwahlin, runs the Web Weekly newsletter  (a great way to stay up on the latest technologies), and writes columns for various  technical magazines. Follow Dan on Twitter @DanWahlin.\n"},"Speaker2":{"name":"Andrew Connell","twitter":"AndrewConnell","email":"me@andrewconnell.com","bio":"Andrew Connell is an independent consultant that enjoys development, writing & teaching.  He is an ten-time recipient of Microsoft’s Most Valuable Professional (MVP) award & has  contributed to numerous books articles and projects over the years. You can learn from  Andrew as when he teaches hands-on courses through http://www.CriticalPathTraining.com  or through one of the many on-demand classes he has published though http://www.Pluralsight.com.  Andrew has spoken at conferences and community events in the North America, Europe & Australia.  You can find Andrew on his blog at http://www.andrewconnell.com, follow him on Twitter at @andrewconnell  or subscribe to his podcast at http://www.MicrosoftCloudShow.com. \n"}},"link":"/#details/supercharge-angularjs-apps-with-typeScript-and-es6"},{"time":"2:10 PM","title":"Community Building How-To: Make More Angular Devs Now","author":"Judy Tuan","key":"community-building","details":{"Session":{"Title":"Community Building How-To: Make More Angular Devs Now","Description":"Angular's success depends on a thriving community. The apps that we create can better serve the world if our diversity reflects the diversity of our audience. How can we attract more developers of all kinds to Angular, and reach out to underrepresented groups? In this talk, I will draw upon my learnings from creating communities in gaming and programming, with a case study of RailsbridgeSF's success in gender diversity outreach and its effects on other programming communities. This talk is a call to action with concrete steps you can take to foster inclusion in the Angular community in your own home city. Angular needs you, and the time is now. \n","Length":20,"Tags":["community","diversity"]},"Speaker":{"name":"Judy Tuan","twitter":"judytuna","email":"judytuna@gmail.com","bio":"Judy is a developer at Indiegogo. In San Francisco, she has volunteered with Railsbridge,  led Women Who Code, and mentored at Hackbright Academy. She loves games, constructed  languages, and singing a cappella. \n"}},"link":"/#details/community-building"},{"time":"2:35 PM","title":"ng-wat?","author":"Shai Reznik","key":"ng-wat","details":{"Session":{"Title":"NG-WAT?","Description":"Inspired by the legendary talk of Gary Bernhardt, It's time we'll have an Angular WAT talk! We'll go over the quirks and funky stuff every new Angular dev waste few hours staring in confusion at the screen trying to figure out... WAT?! Prepare your adult diapers, 'cause this one is gonna be hilarious!\n","Length":15,"Tags":["wat","funny"]},"Speaker":{"name":"Shai Reznik","twitter":"shai_reznik","email":"shai@hirez.io","bio":"Angular consultant, co-organizer of ng-conf IL, GDG lead and founder of the Javascript Israel meetup group. Worked with over 17 enterprise companies migrating large scale apps to Angular. Founded HiRez.io - an online training school aimed to make people laugh while teaching front end architecture. Shai is also an pro Improv performer with a standup comedian background.\n"}},"link":"/#details/ng-wat"},{"time":"2:50 PM","title":"Accessibility Design Made Easy","author":"Julie Ralph","key":"a11y-easy","details":{"Session":{"Title":"Accessibility Design Made Easy","Description":"Learn how Angular and Protractor can help give your app accessibility superpowers. \n","Length":10,"Tags":["accessibility","protractor","testing"]},"Speaker":{"name":"Julie Ralph","twitter":null,"email":null,"bio":"Julie Ralph works as a Software Engineer in Test at Google and is the lead developer on the Angular end-to-end testing framework Protractor.\n"}},"link":"/#details/a11y-easy"},{"time":"3:00 PM","title":"Snack Break"},{"time":"3:30 PM","title":"Why Realtime Matters","author":"James Tamplin","key":"Why-Realtime-Data-Matters","details":{"Session":{"Title":"Why Realtime Matters","Description":"The future of the web is realtime, but the way we develop apps is still based off of the CRUD model. CRUD is a pattern that keeps us blind to updates on the server. It's time to ditch the CRUD model and the $http service. Now is the time to start syncing our data in realtime.\nIn this talk we'll will examine the limitations of a CRUD app. Then using Firebase we'll gut out the $http service, and evolve it to a realtime app with AngularFire.\n","Length":20,"Tags":["Firebase","Realtime"]},"Speaker":{"name":"James Tamplin","twitter":"jamestamplin","email":"james@firebase.com","bio":"James Tamplin is the CEO of Firebase. He has a bachelor's and a master's degree in Industrial and Systems Engineering from the University of Wisconsin. He has been a stage actor in New York, an improv comic, and a realtime data maestro.\n"}},"link":"/#details/Why-Realtime-Data-Matters"},{"time":"3:55 PM","title":"ngModelOptions in 5 minutes","author":"Kent C. Dodds","key":"ng-model-options-in-5-minutes","details":{"Session":{"Title":"ngModelOptions in 5 minutes","Description":"Angular 1.3 brought a sweet new directive to the table called ng-model-options. It gives you more control over how your model gets updated and is very easy to use. Get a quick intro and start using this today!\n","Length":5,"Tags":["angular","ngModelOptions","ngModel","directive"]},"Speaker":{"name":"Kent C. Dodds","twitter":"kentcdodds","email":"kent@doddsfamily.us","bio":"Kent C. Dodds is a professional frontend developer working at Alianza. Kent's an egghead instructor and loves sharing what he knows with the world in small bite-sized videos. Kent's active in the open source community with projects of his own and others (including Angular core). Find him on GitHub (kentcdodds). Kent loves building things with JavaScript (vanilla, Angular, and ReactJS flavors) and talking with people about code. If you like talking about code too, he'd love to chat! And, if you're reading this in a published thing, Kent's also speaking at ng-conf :-)\n"}},"link":"/#details/ng-model-options-in-5-minutes"},{"time":"4:03 PM","title":"How to Teach Angular to your Kids","author":"Katya Eames","key":"how-to-teach-your-kids-angular","details":{"Session":{"Title":"How to teach Angular to your kids","Description":"Tired of your kids asking you for movie money? Teach them Angular and they can make their own money. This talk will show you ways to get your kids interested in Angular. Of course they'll probably still mooch money off you anyway.\n","Length":5,"Tags":["kids","education"]},"Speaker":{"name":"Katya Eames","twitter":"KoshkaEames","email":"katya@theeames.com","bio":"Katya is a High School student who has been doing web development for over a year. She is a huge Sherlock and Dr. Who geek. Her favorite captain is Kirk (Pine). And she loves to remind her father how old he is.\n"}},"link":"/#details/how-to-teach-your-kids-angular"},{"time":"4:11 PM","title":"Run digest cycle in web worker","author":"Dr. Gleb Bahmutov PhD.","key":"digest-cycle-in-web-worker","details":{"Session":{"Title":"Run digest cycle in web worker","Description":"Browser freezes while the digest cycle runs. What if we could keep our angular application the same but offload the digest cycle to separate thread in a web worker? Well, we can! I published the step by step micro angular example that makes it possible in the blog post http://bahmutov.calepin.co/run-angular-digest-cycle-in-web-worker.html Please see the post for the content.\n","Length":5,"Tags":["performance","web worker","digest","fun","just because I can"]},"Speaker":{"name":"Dr. Gleb Bahmutov PhD.","twitter":"bahmutov","email":"gleb.bahmutov@gmail.com","bio":"JavaScript ninja, image processing expert, software quality fanatic.\n"}},"link":"/#details/digest-cycle-in-web-worker"},{"time":"4:20 PM","title":"$asqwatch is real","author":"William Scott Moss","key":"$asqwatch-is-real","details":{"Session":{"Title":"$asqwatch is real!","Description":"All that Angular, all that power. Turns out Angular's best feature can also be the main suspect in your not so fast apps. Those $asqwatches are there, even if you can't see them. Learn how to use less of Angular and speed up your apps by leveraging community tools and simple but powerful techniques.\n","Length":20,"Tags":["performance","speed","$watch","optimizations"]},"Speaker":{"name":"William Scott Moss","twitter":"scotups","email":"scott.moss@hackreactor.com","bio":"Scott is an Engineer and instructor at Hack Reactor where he develops and teaches curricula in Angular and Node. He's also the author of ngFx, the most popular Angular animation library. When he's not assisting students or learning, he spends his time with his family in Oakland, CA or in a gym\n"}},"link":"/#details/$asqwatch-is-real"},{"time":"4:45 PM","title":"Ionic + Angular: Superpowers for Mobile App Development","author":"Adam Bradley","key":"ionic-angular-superpowers","details":{"Session":{"Title":"Ionic + Angular: Superpowers for Mobile App Development","Description":"Mobile devices and browsers are now advanced enough that developers can build native-quality mobile apps using open web technologies like HTML5, Javascript, and CSS. In this talk, we’ll provide background on why and how we created Ionic, the design decisions made as we integrated Ionic with Angular, and the performance considerations for mobile platforms that our team had to overcome. We’ll also review new and upcoming Ionic features, and talk about the hidden powers and benefits of combining mobile app development and Angular.\n","Length":20,"Tags":["ionic","mobile","hybrid","performance"]},"Speaker":{"name":"Adam Bradley","twitter":"adamdbradley","email":"adam@drifty.com","bio":"Co-creator of Ionic Framework and Angular Material Design team member. Regularly writes and speaks about hybrid development with Ionic and Angular. Proud dad, husband, veteran, and dog's best friend. Based in beautiful Madison, WI.\n"}},"link":"/#details/ionic-angular-superpowers"},{"time":"5:10 PM","title":"(Super)Power Management","author":"Igor Minar","key":"super-power-management","details":{"Session":{"Title":"(super)Power Management","Description":"Most of us know how to program computers, profile code, use run-time introspection and meta-programing to do fancy stuff. But did you know that you can use similar tricks to program your brain and profile your thoughts? Did you know that everyone has capability to develop (super)powers? This talk will discuss how to do it sustainably.\n","Length":20,"Tags":["performance","skills","productivity","humans"]},"Speaker":{"name":"Igor Minar","twitter":"IgorMinar","email":"iminar@google.com","bio":"Igor is a software engineer at Google. He is a lead on the Angular project, practitioner of test driven development, open source enthusiast, hacker.\nIn his free time, Igor enjoys spending time with his wife and two kids, doing outdoor activities (including but not limited to sports, gardening and building retaining walls).\n"}},"link":"/#details/super-power-management"},{"time":"5:30 PM","title":"Dinner"},{"time":"8:00 PM","title":"Amazing Party You Won't Want To Miss"}]},{"day":"Friday","items":[{"time":"7:00 AM","title":"Breakfast"},{"time":"9:00 AM","title":"Keynote","author":"Miško Hevery &amp; Rado Kirov","key":"keynote-day-2","details":{"Session":{"Title":"Keynote Day 2","Description":"All about Angular 2.\n","Length":50,"Tags":["keynote","Angular 2","crazy Misko talk"]},"Speaker":{"name":"Miško Hevery","twitter":"mhevery","email":"misko@google.com","bio":"Miško Hevery is the creator of Angular framework. He has passion for making complex things simple. He currently works at Google, but has previously worked at Adobe, Sun Microsystems, Intel, and Xerox, where he became an expert in building web applications in web related technologies such as Java, JavaScript, Flex and ActionScript.\n"},"Speaker2":{"name":"Rado Kirov","twitter":"RadoKirov","email":"radokirov@google.com","bio":"Rado has been on the Angular Core team since Summer 2014. Before Angular, he worked on the Adsense serving stack, responsible for serving billions of ads daily. Being passionate about open source, he made contributions to Angular as a Google-20% project, before making the fulltime jump. He is a recovering academic; ask him about error-correcting codes from algebraic curves (or don't).\n"}},"link":"/#details/keynote-day-2"},{"time":"9:55 AM","title":"Binding to the Cloud with Falcor","author":"Jafar Husain","key":"template-binding-to-the-cloud","details":{"Session":{"Title":"Binding to the Cloud with Falcor","Description":"Every user wants to believe that all of the data in the cloud is available locally on their device. Netflix's Falcor framework creates this illusion for the developer. Falcor allows you to model all of your cloud data sources as one virtual JSON object. \"Falcor\" allows you to code against your remote JSON model using the same APIs you would use on local JSON objects. With Falcor you can use simple JSON operations and path expressions to retrieve precisely the data your templates need. Imagine binding your templates directly to the cloud and letting Falcor take care of the network for you.\nWe'll talk about how Falcor works, and how we're planning on taking advantage of Angular 2.0 extensibility to more tightly integrate the two frameworks.\n","Length":20,"Tags":["json","cloud","template","netflix","falcor"]},"Speaker":{"name":"Jafar Husain","twitter":"jhusain","email":"jhusain@gmail.com","bio":"Jafar Husain is Netflix's Cross-Team Technical Lead and has 16 years of experience in the industry. He's currently a member of the TC39, the Javascript standards body designing the next version of JS. He specializes in building web servers and clients using reactive programming. He is the architect of Falcor, the RESTful data access framework that powers  Netflix clients. A highly-rated speaker, he has spoken at NodeSummit, HTML Dev Conf, QCon, and ReactJS Conf. He has also authored interactive training software to help developers learn reactive programming.\n"}},"link":"/#details/template-binding-to-the-cloud"},{"time":"10:20 AM","title":"TypeScript and Angular 2.0","author":"Jonathan Turner","key":"typescript-and-ng-2.0","details":{"Session":{"Title":"TypeScript and Angular 2.0","Description":"One of the best aids to good craftsmen is the tools they use.  In this session, we'll be looking at upcoming features of TypeScript and related tools and how these features help  you get the most out of your Angular 2.0 development.\n","Length":20,"Tags":["angular2","TypeScript","es6"]},"Speaker":{"name":"Jonathan Turner","twitter":"jntrnr","email":"jont@microsoft.com","bio":"Jonathan Turner is a programming language geek working at Microsoft as the Program Manager on TypeScript. He has been a part of the TypeScript team since its first public release in October 2012. Before TypeScript, he studied programming language and compilers at the  University of Colorado at Boulder and worked on Chapel and Clang/LLVM.\n"}},"link":"/#details/typescript-and-ng-2.0"},{"time":"10:45 AM","title":"What's new in ngAnimate","author":"Matias Niemelä","key":"whats-new-with-nganimate-in-1.4","details":{"Session":{"Title":"What's new with ngAnimate in 1.4","Description":"AngularJS 1.4 will come packaged with a totally new refactor of ngAnimate. The animation platform is now much further broken down and there are some sweet new features we can get our hands on. Let's explore these new features and really see how far our sleek animated interfaces can go. Let's also explore what's in store for Angular 1.5 and 2.0.\n","Length":15,"Tags":["present","future","animations","interfaces","ui","interactivity"]},"Speaker":{"name":"Matias Niemela","twitter":"yearofmoo","email":"matias@yearofmoo.com","bio":"Matias Niemela is a fullstack web developer whom has been programming & building websites for over 10 years. He blogs at yearofmoo.com and has been a core team member of AngularJS for two years. As of now he is a fresh new Googler and in the spring of 2015 Matias will be moving to California to work on AngularJS full time at Google. In his free time Matias loves to build complex things and is always up for public speaking, travelling and tweaking his current Vim setup.\n"}},"link":"/#details/whats-new-with-nganimate-in-1.4"},{"time":"11:05 AM","title":"Building Platforms with Angular","author":"Jen Bourey","key":"building-platforms","details":{"Session":{"Title":"Building Platforms with Angular","Description":"While we often see Angular used to quickly build small applications, it also has the power to drive large frameworks.  Learn how Google has  used Angular to build infrastructure and libraries that support the Google Cloud Developer web console.  We'll talk about challenges the  team has experienced and how we've handled them, from implementing  lazy-loading to assuring consistency and quality across many separate  contributing teams.\n","Length":20,"Tags":["developers","scale"]},"Speaker":{"name":"Jen Bourey","twitter":"jbourey","email":"jennifer.bourey@gmail.com","bio":"Jen currently serves as a Tech Lead in Google's Cloud Platform, one of  Google's biggest angular-powered applications. She has over 10 years of  experience building web portals and has contributed to several open-source projects.\n"}},"link":"/#details/building-platforms"},{"time":"11:30 AM","title":"Reactive all the things","author":"Ben Lesh &amp; Martin Gontovnikas","key":"reactive-all-the-things","details":{"Session":{"Title":"Reactive all the things","Description":"Angular is performant enough for most apps, most of the time; But what happens when you're trying to push every drop of performance out of your browser app? Making your Webapp performant and at the same time have nice, loosely coupled code based on resauble blocks is extremely hard. How would you handle a fire hose of data from socket pushes streaming to your UI while you've got mouse hover events firing? Reactive Programming is the answer to these questions. In this talk, we'll learn first what Reactive Programming really means and then we'll dive into practical examples on how Netflix is leveraging Reactive Programming to make performant, scalable and loosely coupled apps.\n","Length":20,"Tags":["reactive","rx","rxjs","map","observable"]},"Speaker":{"name":"Ben Lesh","twitter":"benlesh","email":"ben@benlesh.com","bio":"Ben Lesh is a Senior UI Engineer at Netflix in Los Gatos, CA. Ben works on realtime data analytics in the browser for events streaming from the Netflix cloud. He is an Angular contributor, and he works with Angular, Ember, RxJS and D3 daily.\n"},"Speaker2":{"name":"Martin Gontovnikas","twitter":"mgonto","email":"martin@gon.to","bio":"Martin Gontovnikas has been a tech nerd since he was 12 years old. Now, he's a web developer, trainer, speaker and writer. He currently works as a Developer Advocate at Auth0. He's a big advocate and contributor for Open Source sofware. He has built Restangular, angularytics, factory_pal, angular-jwt and many more! He (not so) frequently blogs at http://gon.to/blog/ and has spoken at Devoxx, ngEurope and dotJS among others.\n"}},"link":"/#details/reactive-all-the-things"},{"time":"11:50 AM","title":"Lunch"},{"time":"1:20 PM","title":"Angular 1.3 meets Angular 2.0","author":"Michał Gołębiowski","key":"ng-1.3-meets-ng-2.0","details":{"Session":{"Title":"Angular 1.3 meets Angular 2.0","Description":"A lot of Angular 2.0 proposals rely on established best practices from existing Angular 1.3 apps. In this talk I'll show how one can organize the Angular 1.3 project so that it's easier to find one's way in a large code base and migrate to Angular 2.0 in the future.\n","Length":20,"Tags":["migration","angular2","project structure"]},"Speaker":{"name":"Michał Gołębiowski","twitter":"m_gol","email":"m.goleb@gmail.com","bio":"Michał is fascinated by new front-end technologies, especially ECMAScript 6 & further. He's a jQuery Core Team and Angular Working Group member. He loves how easy it is today to contribute to large front-end projects like Angular and in this way have an impact on large part of the internet.\n"}},"link":"/#details/ng-1.3-meets-ng-2.0"},{"time":"1:45 PM","title":"Digging into Angular Style Guide Decisions","author":"John Papa","key":"styleguides","details":{"Session":{"Title":"Digging into Angular Style Guide Decisions","Description":"Jump into the leading style guides for teams working with Angular.  These style guides touch on concepts, syntax, conventions and are based on Todd and John's  experience building Angular applications. Todd and John will talk through best practices,  reasons behind style decisions and inspire you to build the best Angular project yet,  from scaffolding to modular JavaScript.\n","Length":20,"Tags":["Angular","teams","styleguide","patterns"]},"Speaker":{"name":"John Papa","twitter":"john_papa","email":"john@johnpapa.net","bio":"John dabbles in Web technologies including HTML5, JavaScript, CSS, Angular, Gulp as a Principal Developer at Walt Disney World, Google Developer Expert (GDE), and Microsoft RD and MVP. He can often be found speaking around the world at keynotes and sessions for major conferences. John is a co-host of the popular Adventures in Angular podcast and formerly was the host of the show  Silverlight TV on Channel 9. He currently enjoys authoring courses for Pluralsight and has several popular OSS projects including his Angular style guide http://jpapa.me/ngstyles\n"}},"link":"/#details/styleguides"},{"time":"2:10 PM","title":"Better i18n for your Angular apps","author":"Chirayu Krishnappa &amp; Pascal Precht","key":"better-i18n-for-your-angular-apps","details":{"Session":{"Title":"Better i18n for your Angular apps","Description":"Internationalization and Localization are fundamental to making your applications available in different languages and cultures. This is fairly involved and would ideally have a tightly integrated toolchain and workflow to support the entire process. Angular currently only offers some rudimentary support.  While the community has built some great extensions to help in this area, we would really like to have first class support from the framework.  In this talk, Chirayu and Pascal are going to show you their roadmap for a to bring a great i18n experience to the Angular framework.\n","Length":20,"Tags":["i18n"]},"Speaker":{"name":"Chirayu Krishnappa","twitter":null,"email":"chirayu@google.com","bio":"Chirayu is a core Angular team member and has contributed to Angular, AngularDart and Protractor. He loves technology. When not working, he's learning music, improv or painting.\n"},"Speaker2":{"name":"Pascal Precht","twitter":"PascalPrecht","email":"pascal.precht@gmail.com","bio":"Pascal is a front-end engineer with a love for semantic markup and evolving technologies in the open web. He loves contributing to open source and is the creator of the popular angular-translate module. Pascal loves to travel the world and speaks at conferences and meetups. When he's not busy preparing the next workshop or conference talk, you might find him outside with his skateboard.\n"}},"link":"/#details/better-i18n-for-your-angular-apps"},{"time":"2:35 PM","title":"Badges? We don't need no stinkin' badges!","author":"Lukas Ruebbelke &amp; Geoff Goodman","key":"badges","details":{"Session":{"Title":"Badges? We don't need no stinkin' badges!","Description":"Most people wait their entire life to get a badge granting them permission to be awesome. We would like to challenge that notion by telling you how one of the most popular Angular sites came to be. We are going reveal the exact playbook we used to build Plunker with Angular so that it could handle almost 20,000 unique visitors a day. We will also tell you how we did it in our spare time.  You don't need no stinkin' badges to be awesome!\n","Length":20,"Tags":["Angular","architecture","awesome-sauce"]},"Speaker":{"name":"Lukas Ruebbelke","twitter":"simpulton","email":"simpul@gmail.com","bio":"Developer. Hacker. Community backer. Author and blogger. Console logger.\n"},"Speaker2":{"name":"Geoff Goodman","twitter":"filearts","email":"ggoodman@gmail.com","bio":"Analyst. Outsider. Plunker provider. World-class skier. Sightseeer.\n"}},"link":"/#details/badges"},{"time":"3:00 PM","title":"Snack Break"},{"time":"3:30 PM","title":"Build an Angular Material App","author":"Thomas Burleson &amp; Naomi Black","key":"material-tech","details":{"Session":{"Title":"Build an Angular Material App","Description":"Struggling with integrating UI components into your Angular apps? With the Angular Material UI components, you can quickly build responsive, real-world apps that behave seamlessly across multiple devices. See how Gridlist, Icons, and the Toolbar are used with Layouts and Themes to quickly build a real-world app from the ground up!\n","Length":20,"Tags":["material design","angular material","ux"]},"Speaker":{"name":"Thomas Burleson","twitter":"ThomasBurleson","email":"ThomasBurleson@gmail.com","bio":"Passionate about software quality, excellence, guerrilla team development, team leadership/mentoring, and experiential learning.\n"},"Speaker2":{"name":"Naomi Black","twitter":"naomitraveller","bio":"Naomi is the program manager for Angular, including Angular Material. An unrepentant generalist, she's been at Google since 2006, leading projects ranging from Accessibility to Google Transit. She fights daleks in her spare time.\n"}},"link":"/#details/material-tech"},{"time":"3:55 PM","title":"Angular + React = Speed","author":"Dave Smith","key":"angular-plus-react-equals-speed","details":{"Session":{"Title":"Angular + React = Speed","Description":"How we integrated React into our Angular directives at HireVue to give them super turbo speed boost power.\nAt HireVue, we found that some of our directives were slow and janky. After identifying the cause of the slowness in the DOM, we were able to switch to React for the DOM rendering, and we got a huge performance boost.\nThis talk will walk you through what we did, and how we are building React- based directives now, including our pattern for i18n.\n","Length":20,"Tags":["react","performance","directives","hotdogs"]},"Speaker":{"name":"Dave Smith","twitter":"djsmith42","email":"dave@thesmithfam.org","bio":"Dave has been developing software professionally for 10 years. He got his start tinkering on a TI-82 calculator in high school and has worked on projects that span the spectrum from embedded devices to user interfaces. Currently, he works at HireVue on the company's Angular-based web application.\n"}},"link":"/#details/angular-plus-react-equals-speed"},{"time":"4:20 PM","title":"Angular Behind The Scenes","author":"Rodric Haddad","key":"angular-behind-the-scenes","details":{"Session":{"Title":"Angular Behind The Scenes","Description":"In this talk, expect to have an insider's look on the Angular project, from behind the scenes. Rody will speak about how Angular fits internally in Google, answering many of the questions he had before officially joining the project. He'll also present members of the project you might not be familiar with, and talk about his experience from different positions in the community.\n","Length":5,"Tags":["team","core","insider"]},"Speaker":{"name":"Rodric Haddad","twitter":"rodyhaddad","email":"rody@rodyhaddad.com","bio":"Rody has been a contributor to the Angular repo for over a year and a half. He has interned on the Angular project in the summer of 2014, working closely with the core team at Google HQ.\n"}},"link":"/#details/angular-behind-the-scenes"},{"time":"4:45 PM","title":"Change Detection Reinvented","author":"Victor Savkin","key":"change-detection","details":{"Session":{"Title":"Change Detection Reinvented","Description":"Change detection in Angular is a big part of what makes the framework seem like magic. But in Angular 1.x it can be confusing, difficult to debug, and can become a performance bottleneck. Let's look at how change detection is designed differently for Angular2, and how it makes applications simpler and more performant. \n","Length":20,"Tags":["angular2"]},"Speaker":{"name":"Victor Savkin","twitter":"victorsavkin","email":"avix1000@gmail.com","bio":"Victor works on the Angular team at Google. He is interested in functional programming, the Web platform, and client-side applications. \n"}},"link":"/#details/change-detection"},{"time":"5:10 PM","title":"Angular Team Panel/QA","author":"Googlers"},{"time":"5:55 PM","title":"Parting Words","author":"Organizers &amp; Angular Team"},{"time":"7:00 PM","title":"Game Night"},{"time":"10:00 PM","title":"Game Night Ends"}]}]